jad-eng/atmel/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# cub (Native USB Port)
# --------------------------------------
cub_native.name=cub (Native USB Port)
cub_native.vid.0=0x2341
cub_native.pid.0=0x804d
cub_native.vid.1=0x2341
cub_native.pid.1=0x004d
cub_native.vid.2=0x2341
cub_native.pid.2=0x824d
cub_native.vid.3=0x2341
cub_native.pid.3=0x024d

cub_native.upload.tool=bossac
cub_native.upload.protocol=sam-ba
cub_native.upload.maximum_size=262144
cub_native.upload.use_1200bps_touch=true
cub_native.upload.wait_for_upload_port=true
cub_native.upload.native_usb=true
cub_native.build.mcu=cortex-m0plus
cub_native.build.f_cpu=48000000L
cub_native.build.usb_product="cub"
cub_native.build.usb_manufacturer="sparkfun"
cub_native.build.board=cub
cub_native.build.core=cub
cub_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
cub_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
cub_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
cub_native.build.variant=cub
cub_native.build.variant_system_lib=
cub_native.build.vid=0x2341
cub_native.build.pid=0x804d
cub_native.bootloader.tool=openocd
cub_native.bootloader.file=zero/samd21_sam_ba.bin
